[
	"So at the start of break, we were going to go to the math room like usual but then realized it was Doctor Shit Club, so I Telegram’d Dan and told him to go to room 306. We were late because LG had to finish his health assignment, Sean and Dan were waiting out of the room for us. Then we went up and the door to 306 was closed but unlocked, and the lights were off but a movie on. So we contemplated whether or not to go in and decided we should because we thought that someone would be in later. We went in and were hanging out like usual, sharing laughs, poking fun at people failing physics with a 45, and then Vytas and the crew came in with some white kid that was obsessed with LG. Vytas was dressed as Borat for Halloween and wanted to show us a ganster scene from the Borat movie which was supposed to be all of the rage. We tried playing it on Dan’s computer but the sound would not play, so we tried it on my phone. Because I use an iPhone and was trying to use a Google app, it didn’t work. So we tried to play it on Vytas’ phone but his speaker is broken since he dropped his phone a while ago. So then I came up with the idea to play it on the computer which was projecting the movie. Vytas went up to the computer and looked up the YouTube video, I said “What could go wrong” and someone else said “I doubt that Mr. Kaune will come in, just play it.”. Being peer pressured Vytas committed to the job, Jalshallow went into the hall and watched guard and only 5 seconds later started screaming and ran into the room. I heard Mr. Kaune’s booming voice from all the way down the hall as fear entered all of our hearts. Sean slipped out of the room and nobody even noticed, Jalshallow tried to say “allahu akbar”, Dan and I tried to act like lost white people, and LG did his usual thing. Vytas was instantly sent to the VP’s office. LG and I (since we had a class in the same room with Mr. Kaune next period) were told in a booming voice to stand outside during class and don’t come in. Mr. Kaune sat us down and brought another teacher along with him for backup. Then he told LG and I that we had had the exact same talk before and that we betrayed his trust. We are never allowed in the room again with the exception being class."
]
