[
	"can matlab be a way of life? Can I work at simulink just making matlab scripts. or math works. whoever makes matlab",
	"You could technically if they were hiring lol",
	"I'm pretty syre there are jobs that require lots of matlab",
	"it's funny, because when I was in my chem undergrad I always heard the engineers complain about matlab (my guess is they weren't elec or comp so they didn't get coding) and now I use it and I'm like what's wrong with it, it's so handy!",
	"I agree. In first year everyone hated on matlab, and I really didn't get it",
	"it was funny though, because at the time I didn't really know what matlab was... so I assumed it was some super complicated software that was hard to use or something ",
	"it is funny that you know now its actually useful",
	"at least it's well documented",
	"I know!",
	"I thought the relection coefficient was supposed to be 0 to have no reflection? what is 0 in dB?",
	"nevermind, goes to -inf :( I obviously don't remember how to use log",
	"Infinity is basically a dead eight - Korenburg 2016 November",
	"Thank you, we ought to have been keeping a book of his quotes.",
	"yah that doesn't make sense.",
	"I don't understand this class. :(",
	"help! ... did anyone figure out how to calculate the bandwidth frequency?",
	"nope.",
	"no, sorry!",
	"does anyone else freakout and think he's about to fall everytime ",
	"yeah I'm too hungry to have to deal with him breaking bones or getting hurt.",
	"I want foooooooooooood!",
	"can we get food then work on 353?",
	"I want perogies tbh.",
	"yes, but I have work tonight at 3:15",
	"does anyone know how they got the E2 and E1 terms?",
	"They found eta earlier. and then rearranged the eta = sqrt(mu_0/E). I think.",
	"also we're in glass so we can assume that mu_2 = 1",
	"Yeah I know how they got eta, but that first line there?",
	" (non-magnetic media)",
	" no I'm saying they got eta before and rearranged the equation I pasted to get E",
	"ohhhh, they just wrote it in a different order?",
	"Those are epsilons, just in a different font",
	"yeah, the epsilon onn the first line",
	"if you have eta, and you know that mu_2=1, then you have epsilon",
	"tbh I'm still confused lol",
	"marina, can you show me tomorrow irl?",
	"yeah that would probably be best",
	"There you go! Right hand rule! You heard it from a physicist! - Korenburg 2016",
	"This class is great, we've degenerated so far",
	"see hind, now don't you love him?",
	"lol",
	"love it",
	"I wonder if any of our profs notice that a few of us start laughing at the same time for no apparent reason sometimes"	

]
