[
	"If you care, I would like to say that when I was in APSC 200 I enjoyed your course and the unique perspectives you had to offer. When you mentioned APSC 381, and after my own research into the course via its calendar description, I was intrigued. The aspect of multidisciplinary engineering you described was exactly what I happened to be lacking in my other courses. Your course descriptions, both online and verbally, made me believe that I would be able to take away something from the course. However, I no longer think so. The project descriptions that were posted tonight really disappointed me, and I understand that the project shouldn’t matter but, to be frank, these project were less interesting and far less multidisciplinary than even our APSC100 project in first year. The projects really did seem gimmicky and something one would find in a dollar stor and I find that insulting. In fact, the ECE projects that were offered this year by the professors have far more potential to be entrepreneurial and would definitely benefit from the multidisciplinary aspect of design engineering that you described, something lacking from APSC381.",
	"I understand that your opinion may differ but along with the above, many QUIP, co-op, and new grad positions, especially in ECE are looking for projects that students complete. The projects defined above, along with the deliverables described tonight do not lead me to believe that after the completion of APSC381 I would have something more or at least as equally tangible and presentable as what I would receive from ELEC390. The first lecture has truly made me believe that there is not much value in what I can show for taking APSC381, especially now that it cannot be taken at the same time as ELEC390.",
	"Thank you very much for your thoughtful response.  I respect your opinion and should you wish to drop the course in favour or ELEC 390, I completely understand.  However, I would ask that you consider this from a different perspective before you make a final decision",
	"The overall purpose of APSC 381 is to teach and encourage learning of proven processes, tools, and critical “design thinking” aspects required for high performance designers and entrepreneurs.  These elements can be applied to almost any future endeavour a student or graduate may pursue.  My own experience – and education research – clearly shows that overly complex projects in courses that are intended to focus on process in fact deter the participant from achieving the actual course objectives.  We have offered more complex electrical/electronic/electro-mechanical projects in this course in the past, and invariably, in an 11 week window, at the third year level, students struggle to achieve viable solutions, and in trying, often miss the intended learning – which is about HOW to do effective design.  Your perspective may perhaps be different because of what you have learned in your internship, but for most, complex projects in that time frame do not support the learning objectives.",
	"The intention of being design competency focused in APSC 381 is to prepare students for the far more complex and real projects they will face in APSC 480.  Once armed with a proven pathway, an effective “toolkit”, and the confidence derived from applying and learning these elements to a smaller, less complex project (in 381), they are extremely well prepared for the challenge of real-time, well funded projects with an industry client.",
	"The strategy for APSC 381 and APSC 480 has been developed over more than a decade, and has had the benefit of feedback from many, many graduates of this stream over that time.  The question of what sort of projects should be offered in APSC 381 have been discussed with those (typically very successful) graduates on many occasions.  Their response is unanimous – focus on HOW to do effective design in APSC 381 and keep the projects less complex, thus providing excellent preparations for students to tackle the real and far more complex challenges in APSC 480.",
	"While ELEC 390 may be i appealing because of the “higher tech” nature of the project offerings, there is very little, if any, advanced design process/tools content (unless the course has been substantially revised since last year).  As I understand it, 390 is essentially the front end of what will become the 490 project.  Almost all the projects are internal, with no industry contact, and the funding for prototyping is minimal.  APSC 480 projects are all client-based, very well funded, with regular client meetings (often at their facilities), funding for software, equipment, material, services, prototyping – whatever is needed to do the projects – into the thousands of dollars. The experience gained in these projects is incredibly valuable on resumes and in interviews for preferred employment, and in fact many of our clients hire students from project teams.",
	"I would offer one further comment about the projects.  The vast majority of students in APSC 381 this year are CHEE, with a lesser amount of MECH’s, and ther rest being small numbers from other disciplines.  Hence the majority of projects we offer do not have mandatory ECE content.  However, there are a number of project where there are in fact substantial challenges for ECE students:  the toothbrush for people with tremors has an opportunity for sensing/feedback/control systems requiring very high tech electronics and controls; the baseboard cleaning challenge offers robotics solutions, requiring motors, batteries, sensors, communication technology, etc; the anti-nail-biting project could incorporate motion/position or even vision sensing technology; even the self-righting kayak challenge offers ECE challenges in sensing and activation possibilities.  The difference between these projects and ELEC 390 projects is that we don’t specify the details of what to do to solve the problem – we let the students determine that for themselves – and that in fact offers as much or more entrepreneurial considerations than any pre-specified project.  It’s all about perspective, and I think you may have overlooked this opportunity in these project offerings.",
	"I would rarely spend this much time explaining all this to a student who intends to drop the course, but given the rationale you presented for dropping the course, I thought it worthwhile for you to hear (read) the rationale for why APSC 381 and 480 are structured in this manner.  It has proven to be extremely effective and successful for those who have been through this multidisciplinary design stream.  Should you believe ELEC 390/490 offers you a better path, as I said at the outset, I respect your choice.",
	"If you would like to discuss this in person, I’d be glad to do so.  In either case, I would appreciate your thoughts after reading this",
	"Have you had a chance to read my reply?  I’d very much like to talk with you about this. ",
	"I would like to say that I have the utmost respect for yourself and what you have brought to the FEAS at Queen’s. I am very interested in the ideas behind APSC381/480 and if I had the ability to take them in tandem with the ELEC 390/490 courses I would in a heartbeat. However, I cannot at this time, reasonably bring myself to chose APSC381/480 over ELEC390/490 and that really does just have to do with what I want to take away more. I understand I was a bit critical but these are my thoughts and I do express them most respectfully and I hope you understand that.",
	"One last comment I would like to make is that the fact that there are so many CHEE and MECH enrolled in the course and such few ECE students does mean, like you mentioned, less of a tech focus. Increasingly in many industries control systems and processes are run by computers or managed and inspected using highly sophisticated sensors. I recently completed a co-op term at OPG and the overall theme I heard was that much of the work done by the Mechs, Civils, and Chems at the company was now being completed more efficiently with the use of the many embedded systems involved all over their fleet. A lot of their teams were finding themselves working with electrical engineers and electronics experts more and more often. Respectfully, your own and Professor Lewis’s backgrounds are quite mech/materials heavy. Coupled with the large number of CHEE and MECH students I really find it difficult to see the value I can gain from taking APSC 381 over the experiences I would receive in ELEC 390. I truly think it has been an error to make the courses mutually exclusive.",
	"I understand that many of these concerns are applicable to only a small subset of students. However, this does reduce the value of APSC 381 for me, and, although ELEC 390 is lacking in the multi-disciplinary design and process aspect of real engineering, these soft skills are ones I can develop by taking management courses offered to engineers from the Smith School of Business. On top of that, many of our courses have switched away from the “plug and chug” method of testing. My Analog IC Circuits & Systems course has an open-ended student-defined project in place of a final, that requires students to outline a proposal, develop a business plan, conduct market research, and finally present our findings as well as the project. In terms of “complicated” projects, I think it is unfair to say that a complex problem couldn’t be solved in the time period that we have. In APSC 100 Mod 3, my team was given a project that required construction of a filter that would not allow water to freeze on it. The project combined aspects of chemical/civil engineering with mechanical and electrical engineering and was completed well within the time period given. The technical aspects of the project didn’t take away from the design process aspects either as we consistently graded higher in deliverables than our counterpart teams",
	"To be completely honest, I agree with a lot of what you have said and I have similar concerns about 390 to what you outlined below. I also do see that 2 or 3 of the projects in 381 do have an aspect that could use ECE (in fact as a manager for QMAST I was involved with the APSC202 team that did a self balancing boat/catamaran, similar to the kayak project). I think a big concern of mine really is in what I can have to show for my work at the end of the term. It seems that most students will likely not be getting their first choice, and I personally don’t see myself taking that risk. This is mainly due to the fact that I am looking to pursue a QUIP position starting in May, and far more often than not, companies are asking for relevant projects that students or new grads have completed. It is my belief that for me to be competitive and show that I would be valuable I would need projects that not only pop out of a CV but also show that I have the technical skills to complete the task, and I don’t see that potential in the majority of the APSC 381 projects (this does not speak at all for 480). Similarly, many QUIP and new grad position in ECE ask for certain required skills (soldering, PCB design, etc.). ELEC 390 this year has workshops for working on skills such as these. ELEC 390 has actually gone through a major revision since last year. And, although 390 is the preface to the 490 projects, students are still encouraged to interface with their faculty supervisor and I know students that have taken that and become close with their professors. This allows for a very unique input from individuals who have worked in the industry and now teach it. In my experience, this has been quite valuable. From what I heard in last night’s class was that we were really discouraged from asking the professors of the course and should really just ask the TAs.",
	"I apologize for the late reply, I’ve had class today from 8:30 and just got back home. I would like to thank you for your quick reply and also for your thorough response. I have outlined my thoughts below but if you would rather speak in person, I am free tomorrow before noon and again between 2:30 - 4:30 and I wouldn’t mind stopping by",
	"My door is still open if you’d like to discuss this further, as is the class if you were to change your mind.",
	"Since it seems your decision is final (unless my comments above may have swayed you), one other thing that may be possible, should your thinking change between 390 and 490, is that I occasionally allow students into APSC 480 by application, with necessarily having the APSC 381 pre-req (you’ll see this on the calendar as APSC 381 or by permission of the instructor).  It depends on what projects I end up with in APSC 480, and what the enrollment looks like to match those projects, but for example this year I believe there were 6 or 7 students that opted out of ELEC 490 to take APSC 480.  It requires a few make-up class sessions to cover some of the key material missed in 381 (without the prior opportunity to apply it), but it helps get the students who do this caught up with those who took 381.  It has typically worked very well for diligent students who want to benefit from the APSC 480 experience.  But it isn’t a guarantee due to the project/enrolment mix, and in fact your department could deny it if they choose to.  At the moment, students who pursue this option are required to drop ELEC 490, but perhaps that could change over time.",
	"There is more but I’ll leave it at that.  I’m pleased that you feel the revisions in ELEC 390 will provide the opportunities you are looking for.  However, I will also add that I rarely have a student that has been so thoughtful in their consideration and response on an issue like this, and honestly, I would have very much enjoyed having you in my classes.  I think you may have found APSC 381 more aligned with your interests than you may have expected.",
	"The mutual exclusivity of 381/480 and 390/490 is a recent development.  Students prior to last year could take both streams if they wished, but a department decision changed that.  If you feel strongly otherwise (as a number of our Faculty do, including some in your department), I encourage you to make your voice heard.  Some faculty members argue that it is “double dipping” because the courses are the same.  In fact, the courses and experiences are quite different, and I think there is tremendous value for students to experience both.  My opinion will never change this – students actually have far more “voice” than a faculty member or two.",
	"As for the “soft skills” you mention, yes, some of those “professional” skills (I prefer not to use “soft” as they are anything but) can be learned elsewhere. However, many of the techniques and processes that we embed in APSC 381 are rarely taught elsewhere, and in fact are elements of advanced design skills, not professional skills.  I’m referring to things like QFD, TRIZ, risk analysis, 6sigma, FMEA, etc.  You might pick them up in other courses, but it’s not common.  Moreover, in APSC 381 they are not only taught but embedded in the project expectations, thus ensuring application for deeper learning.  Many of my past students rave about the value of these things, and how they continue to apply and often teach them in their companies",
	"• While there are a substantial number of CHEE students (and a much smaller proportion of Mechs), most of our past classes have looked something like this (although the CHEE/MECH ration was typically reversed).  As I mentioned in class, there are many overlaps in course content, but moreover, these are all very bright and capable students, and their ability to contribute to projects, even beyond their discipline, is far more reliant on attitude than it is past course content.  Good teams learn on their own as well as from each other, regardless of discipline, and we have seen some amazing results of that collaboration.",
	"• As for the project complexity issue, my point was that we don’t impose complexity, but the projects certainly offer the students the opportunity to introduce whatever level of technology they feel is needed for their solutions.  I even fund prototyping for students who have a good design and effective plan.  However, it is also important to recognize that the point of this course is not to mandate this – but rather to ensure that students develop a good grasp of HOW to design with a high likelihood of success.  It is very rewarding as an instructor when teams combine this with an excellent grasp of technology as well. ",
	"Victoria also mentioned a concern about my requirement for attendance, and my position on cell phone use in class.  The issue of attendance is to address the many students who would take advantage of an optional attendance policy.  I didn’t start these courses with this requirement – in fact I never wanted to have “rules” of this nature in any of the APSC design courses – but rather appealed to the students to take responsibility for themselves in staying on top of the material and their team.  Far too many didn’t, and having seen the incredible stress and outright anxiety it creates for students who are trying to do well and get things in on time (which I see and hear from peer review comments, reflections, and face to face meetings), I have had no choice but to mandate attendance.  I wish it were otherwise.  Similarly, with cell phones and laptops, the “open” approach was vastly abused, and we had to impose rules on this issue.  I’m really not that harsh and I understand and accept valid exceptions to these requirements, as long as they are occasional and valid.",
	"Victoria mentioned that there was discussion of me being “unapproachable”.  Perhaps I over-stated the issue of making the TA’s the first contact, but that’s because the vast majority of student questions are around marks on course submissions, and they are best to consult the TA first in this case.  I, in fact, try to make myself available to any student who wishes to see my for almost any reason.  I am often consulted by my 381 and 480 students to simply help them discuss post-graduate options or job choices.  I am busy, and hence cannot necessarily be available to students at their beck and call, but I am always willing to see students or teams with an appointment that fits my schedule (or even in the evening).  While it is difficult to be “close” to all of my APSC 381 students, simply due to class size and my shared teaching with Prof Lewis, were you to ask most of my APSC 480 students, I think you’d get a totally different response as to my approachability and my willingness to support them",
	"While my background (and Trevor’s) may originally be mech and materials, respectively, we both have extensive experience leading projects of all kinds – product development, process development, etc.  I have been deeply involved in everything from motors to charging systems (one of which is patented) to extremely high tech microprocessor based electronics for medical devices (during my term with a startup biomedical company).  I have also supervised projects in APSC 480 in some very high tech areas involving electronics, microprocessors, and communications.  While I am not by any means an expert in these areas, I understand them quite well and also have a network of contacts that I involve to support students in projects of this nature. ",
	"The vast majority of students are placed in their top 2 or 3 project choices, and of course ELEC, COMP, and ENPH students in these options are given preference in projects requiring those skills.  We often pair up two ELEC’s or an ELEC and a COMP in the same project, depending on the need. ",
	"Thanks again for your thorough and articulate reply.  I honestly wish you (as well as Damian and Victoria) would have considered meeting with me to ask me about your concerns before starting the course drop process.  I met with Victoria yesterday afternoon, and she was pre-determined to drop the course, so I think some of our discussion was moot. Given your thorough thinking on this issue, I think you and I could have had an excellent discussion that might have given you reason to reconsider.",
	"Sorry for the late reply. I wouldn’t mind dropping by; I’m free after 3:30 tomorrow but let me know what works best for you."


]
